#pragma once

#include <utility>

namespace cg
{
	// ==================================================
	// 魔法卡
	// ==================================================

	// 种类
	enum class SpellCategory : std::uint8_t
	{
		NONE = 0,

		// ====================================

		// 通常
		NORMAL = 1 << 0,
		// 速攻
		QUICKPLAY = 1 << 1,
		// 装备
		EQUIP = 1 << 2,
		// 场地
		FIELD = 1 << 3,
		// 永续
		CONTINUOUS = 1 << 4,
		// 仪式
		RITUAL = 1 << 5,
	};

	// ==================================================
	// 陷阱卡
	// ==================================================

	// 种类
	enum class TrapCategory : std::uint8_t
	{
		NONE = 0,

		// ====================================

		// 通常
		NORMAL = 1 << 0,
		// 永续陷阱
		CONTINUOUS = 1 << 1,
		// 反击陷阱
		COUNTER = 1 << 2,
	};

	// ==================================================
	// 魔法卡 & 陷阱卡
	// ==================================================

	// 咒文速度(理论上可以不需要)
	enum class SpellSpeed : std::uint8_t
	{
		// 通常魔法/装备魔法/场地魔法/永续魔法/仪式魔法
		S1 = 1,
		// 速攻魔法/通常陷阱/永续陷阱
		S2 = 2,
		// 反击陷阱
		S3 = 3,
	};

	// 咒文状态
	enum class SpellStatus : std::uint8_t
	{
		NONE = 0,

		// ====================================

		// 盖放状态(里侧)
		SET = 1 << 0,
		// 发动中/表侧表示
		ACTIVE = 1 << 1,
		// 效果被无效化
		NEGATED = 1 << 2,
	};
}
